Revit 2027 API
BuiltInFailures.DimensionFailures.NoConstraintsToLinks Property
 Constraints may not be created to linked instances using Shared Locations.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoConstraintsToLinks { get; }
Public Shared ReadOnly Property NoConstraintsToLinks As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoConstraintsToLinks {
	FailureDefinitionId^ get ();
}
static member NoConstraintsToLinks : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace